{
  "posts": [
    {
      "title": "Singapore see off Qatar to keep pace with Canada at top of Challenge League A table",
      "body": "Singapore prevailed in a closely-fought, rain-affected match against Qatar to close out a six-run win in their opening match of the second leg of CWC Challenge League A, keeping pace with hosts Canada at the top of the table with five wins from six overall.\n\nAt the other end of the table, Vanuatu started off their tour with only their second win of the competition, again besting Malaysia albeit without captain and lead wicket-taker, Patrick Matautaava, who remains stranded in Denmark along with two Danish players waiting for his visa to clear.\n\nVanuatu nonetheless took advantage of the conditions as Malaysia struggled to put partnerships together on another difficult King City wicket, only a dogged 28 from Virandeep Singh at the top of the order and a battling unbeaten 42 from Khizar Hayat at seven, dragged them to a total of 124.",
      "tags": [
        "CWCCHALLENGE",
        "LEAGUEA"
      ],
      "authors": [
        " Cricbuzz Staff",
        "Janak Prakash"
      ],
      "id": 1
    },
    {
      "title": "India squad analysis: Who will open with Rohit and the reserve spinner conundrum",
      "body": "India have announced the squad for the Asia Cup to be played in the UAE from August 27 till September 11, by which time they will have to announce the provisional squad for the T20 World Cup in Australia. The 15 picked gives a clear indicator of the players likely to be on the plane to Australia, with some spots still up for grabs. The two big names missing from the squad are Jasprit Bumrah and Harshal Patel, both of whom are certain starters in the XI, but the latter is racing against time to be fit for the mega-event.\n\nIndia's squad for the Asia Cup: Rohit Sharma (Captain), KL Rahul (vice-captain), Virat Kohli, Surya Kumar Yadav, Deepak Hooda, Rishabh Pant (wicket-keeper), Dinesh Karthik (wicket-keeper), Hardik Pandya, Ravindra Jadeja, R. Ashwin, Yuzvendra Chahal, Ravi Bishnoi, Bhuvneshwar Kumar, Arshdeep Singh, Avesh Khan.\n\nReserves: Shreyas Iyer, Axar Patel, Deepak Chahar",
      "tags": [
        "India",
        "Cricket"
      ],
      "authors": [
        "Deepu Narayanan"
      ],
      "id": 2
    }
  ]
}